import React from "react";
import styles from "../../../../pages/Services/Settlement agreement/styles/SettlementApplicationPage.module.css";

const Page6Content = ({
  formData,
  errors,
  handleChange,
  handleFocus,
  handleBlur,
  inputRefs,
}) => {
  return (
    <div className={styles.contractText}>
        <p className={styles.justifiedText}>
          3.2.17. Після закінчення навчання або при достроковому припинення дії Договору згідно п. 7.4. Договору, здати в належному та придатному для проживання стані житлове приміщення (вільне від особистих речей) та майно гуртожитку, що перебувало в користуванні, відповідно до Акту приймання - передачі (додаток 2) та виселитись з гуртожитку в трьохденний термін від дня видачі відповідного наказу.
        </p>
        <p className={styles.justifiedText}>
          3.2.18. У зв'язку з введенням воєнного стану в Україні Указом Президента України від 24 лютого 2022 року No64/2022 «Про введення воєнного стану в Україні» дотримуватись загальних правил поведінки мешканців гуртожитків студентського містечка НУБіП України в умовах воєнного стану та комендантської години.
        </p>
        <h3 className={styles.centeredTitle}>4. МЕШКАНЦЮ ЗАБОРОНЯЄТЬСЯ:</h3>
        <p className={styles.justifiedText}>
          4.1. Без дозволу завідувача гуртожитку:
        </p>
        <p className={styles.justifiedText}>
          - переселятися з однієї кімнати в іншу;
        </p>
        <p className={styles.justifiedText}>
          - переробляти чи переносити інвентар і меблі гуртожитку з одного приміщення до іншого або виносити їх з гуртожитку.
        </p>
        <p className={styles.justifiedText}>
          4.2. Проводити електромонтажні роботи в кімнатах та в гуртожитку, переробляти і ремонтувати електроустаткування.
        </p>
        <p className={styles.justifiedText}>
          4.3. Проводити переобладнання та реконструкцію житлового приміщення.
        </p>
        <p className={styles.justifiedText}>
          4.4. Користуватися та зберігати в житлових кімнатах електрообігрівачі, мікрохвильові печі, електрочайники, мультиварки та інші потужні енергоємні електроприлади.
        </p>
        <p className={styles.justifiedText}>
          4.5. Використовувати холодильники рік випуску яких передує 2007 року.
        </p>
        <p className={styles.justifiedText}>
          4.6. Порушувати тишу з 22:00 год. до 07:00 год.
        </p>
        <p className={styles.justifiedText}>
          4.7. Залишати сторонніх осіб у гуртожитку та мешканців інших кімнат цього ж гуртожитку після 22:00 год. без письмового дозволу завідувача гуртожитку.
        </p>
        <p className={styles.justifiedText}>
          4.8. Утримувати в гуртожитку тварин.
        </p>
      </div>
  );
};

export default Page6Content;