import React from "react";
import styles from "../../../../pages/Services/Settlement agreement/styles/SettlementApplicationPage.module.css";

const Page3Content = ({
  formData,
  errors,
  handleChange,
  handleFocus,
  handleBlur,
  inputRefs,
}) => {
  return (
    <div className={styles.contractText}>
        <p className={styles.justifiedText}>
          2.1.11. Відвідувати кімнату в присутності адміністрації гуртожитку та/або представників органів студентського самоврядування Університету і перевіряти загальний стан житлової кімнати (в т.ч. при відсутності мешканців).
        </p>
        <p className={styles.justifiedText}>
          2.1.12. При не виконані Мешканцем зобов'язань взятих ним у п. 3.2.17 адміністрація Університету має право відкрити кімнату в присутності представників органів студентського самоврядування Університету, залишені речі самостійно перемістити у будь-яке інше приміщення без зобов'язань Університету за їх збереження перед Мешканцем.
        </p>
        <p className={styles.justifiedText}>
          2.1.13. Переселяти тимчасово Мешканця в інше житлове приміщення за рішенням адміністрації Університету у разі відсутності бюджетного фінансування або фінансування в неповному обсязі видатків на теплопостачання, водопостачання та водовідведення, електроенергію, природній газ та інші енергоносії, проведення дератизації чи дезінсекції в гуртожитку або за інших форс-мажорних обставин, викликаних воєнним станом в країні, або у зв'язку з необхідністю тимчасового припинення функціонування гуртожитку на час зимового періоду, які в цей період не опалюються.
        </p>
        <p className={styles.justifiedText}>2.2. Мешканець має право:</p>
        <p className={styles.justifiedText}>
          2.2.1. Вимагати від Університету виконання обов'язків передбачених нормативно-правовими актами, що регулюють відносини, які складають предмет цього Договору.
        </p>
        <p className={styles.justifiedText}>
          2.2.2. Користуватися житловими приміщеннями, місцями загального користування, приміщеннями навчального, культурно-побутового та спортивного призначення та житлово-комунальними послугами відповідно до умов Договору.
        </p>
        <p className={styles.justifiedText}>
          2.2.3. Обирати органи студентського самоврядування гуртожитку і бути обраним до їх складу. Через них брати участь у вирішені питань пов'язаних з поліпшенням житлово-побутових умов, організації культурно-виховної роботи, дозвілля тощо.
        </p>
        <p className={styles.justifiedText}>
          2.2.4. Звертатись до адміністрації Університету, інших державних установ та відомств відповідно до Закону України «Про звернення громадян» з скаргами щодо незадовільної роботи працівників гуртожитку та невідповідності житлово-побутових умов проживання вимогам чинного законодавства України.
        </p>
        <p className={styles.justifiedText}>
          2.2.5. Достроково припинити дію договору шляхом подачі відповідної письмової заяви.
        </p>
      </div>
  );
};

export default Page3Content;