import React from "react";
import styles from "../../../../pages/Services/Settlement agreement/styles/SettlementAgreementPage.module.css";

const Page4Content = ({
  formData,
  errors,
  handleChange,
  handleFocus,
  handleBlur,
  inputRefs,
}) => {
  return (
    <div className={styles.contractText}>
        <h3 className={styles.centeredTitle}>3. ОБОВ'ЯЗКИ СТОРІН</h3>
        <p className={styles.justifiedText}>3.1. Університет зобов'язаний:</p>
        <p className={styles.justifiedText}>
          3.1.1. Утримувати гуртожиток відповідно до встановлених санітарних правил, норм експлуатації та ремонту житлового фонду.
        </p>
        <p className={styles.justifiedText}>
          3.1.2. Забезпечувати надання Мешканцю житлово-комунальних послуг (в тому числі гаряче водопостачання згідно графіка) відповідно до санітарних норм і виділити для цих цілей необхідні приміщення згідно п. 1.1. Договору.
        </p>
        <p className={styles.justifiedText}>
          3.1.3. Організовувати проведення поточного та капітального ремонту гуртожитку, інвентарю, обладнання, згідно з планом ремонтних робіт на календарний рік. Своєчасно проводити підготовку гуртожитку і його технічного обладнання до експлуатації в осінньо-зимовий період.
        </p>
        <p className={styles.justifiedText}>
          3.1.4. У разі виникнення надзвичайних ситуацій та аварій негайно вживати заходів по ліквідації їх наслідків.
        </p>
        <p className={styles.justifiedText}>
          3.1.5. Ознайомити Мешканця при підписанні Договору з нормативно-правовими актами, що регулюють відносини, які складають предмет цього Договору.
        </p>
        <p className={styles.justifiedText}>
          3.1.6. Надати Мешканцю перепустку для його входу в гуртожиток.
        </p>
        <p className={styles.justifiedText}>
          3.1.7. Проводити обмін постільної білизни відповідно до санітарних норм.
        </p>
        <p className={styles.justifiedText}>
          3.1.8. Після припинення дії цього Договору прийняти приміщення від Мешканця за актом приймання-передачі у стані, в якому приміщення було передано Університетом.
        </p>
        <p className={styles.justifiedText}>3.2. Мешканець зобов'язаний:</p>
        <p className={styles.justifiedText}>
          3.2.1. Користуватися наданими житловим приміщенням, майном, місцями загального користування виключно за прямим призначенням і на рівних правах з іншими мешканцями.
        </p>
        <p className={styles.justifiedText}>
          3.2.2. Знати і дотримуватися положень нормативно-правових актів, які передбачені п. 2.1.1 цього Договору.
        </p>
        <p className={styles.justifiedText}>
          3.2.3. Перед поселенням у гуртожиток пройти медичний огляд, подати необхідні документи для оформлення поселення та при необхідності реєстрації місця проживання.
        </p>
        <p className={styles.justifiedText}>
          3.2.4. Житлове приміщення використовувати виключно для особистого проживання.
        </p>
      </div>
  );
};

export default Page4Content;