import React from "react";
import styles from "../../../../pages/Services/Settlement agreement/styles/SettlementApplicationPage.module.css";

const Page7Content = ({
  formData,
  errors,
  handleChange,
  handleFocus,
  handleBlur,
  inputRefs,
  endYearSuffixRef,
}) => {
  return (
    <div className={styles.contractText}>
        <p className={styles.justifiedText}>
          4.9. Допускати антисанітарний стан в житловій кімнаті та місцях загального користування.
        </p>
        <p className={styles.justifiedText}>
          4.10. Викидати відходи від приготування їжі в туалети та раковини.
        </p>
        <p className={styles.justifiedText}>
          4.11. Прати білизну у раковинах для миття посуду та умивання.
        </p>
        <p className={styles.justifiedText}>
          4.12. Псувати майно гуртожитку.
        </p>
        <p className={styles.justifiedText}>
          4.13. Палити в гуртожитку та на його території сигарети, в тому числі електронні сигарети і кальян, крім спеціально відведених для цього місць.
        </p>
        <p className={styles.justifiedText}>
          4.14. Проносити, вживати та зберігати в гуртожитку спиртні та слабоалкогольні напої, наркотичні або токсичні речовини, включаючи електронні сигарети та кальян.
        </p>
        <p className={styles.justifiedText}>
          4.15. Перебувати в гуртожитку в стані алкогольного, токсичного або наркотичного сп'яніння.
        </p>
        <p className={styles.justifiedText}>
          4.16. Зберігати вогнепальну, пневматичну і холодну зброю, пристрої для відстрілу гумових куль.
        </p>
        <p className={styles.justifiedText}>
          4.17. Зберігати та користуватися вогненебезпечними та хімічно-агресивними речовинами у гуртожитку.
        </p>
        <h3 className={styles.centeredTitle}>5. ПЛАТА ЗА КОРИСТУВАННЯ ЖИТЛОВИМ ПРИМІЩЕННЯМ</h3>
        <p className={styles.justifiedText}>
          5.1. Розмір оплати за користування житловим приміщенням, визначається розрахунками вартості 1-го ліжко-місця за місяць та затверджуються наказом ректора Університету.
        </p>
        <p className={styles.justifiedText}>
          5.2. Мешканець здійснює оплату за користування житловим приміщенням згідно Положення про порядок поселення (переселення, виселення) студентів та аспірантів (докторантів) університету в гуртожитки студентського містечка, в якому зазначаються строки та порядок платежів.
        </p>
        <p className={styles.justifiedText}>
          5.3. Моментом виконання зобов'язання по оплаті за житло є дата зарахування коштів на розрахунковий рахунок Університету.
        </p>
        <p className={styles.justifiedText}>
          5.4. Університет має право збільшити вартість проживання у гуртожитку, про що видається відповідний наказ Ректора. При незгоді Мешканця з вартістю проживання він має право розірвати цей Договір в односторонньому порядку шляхом надання Університету письмового повідомлення та погашення заборгованості за проживання.
        </p>
        <p className={styles.justifiedText}>
          5.5. Якщо Мешканець належить до пільгових категорій громадян йому надаються пільги по оплаті за наказами ректора Університету згідно норм чинного законодавства України.
        </p>
      </div>
  );
};

export default Page7Content;