import React from "react";
import styles from "../../../../pages/Services/Settlement agreement/styles/SettlementApplicationPage.module.css";

const Page5Content = ({
  formData,
  errors,
  handleFocus,
  handleBlur,
  inputRefs,
  taxIdRefs,
  handleTaxIdChange,
  handleTaxIdKeyDown
}) => {
  return (
    <div className={styles.contractText}>
        <p className={styles.justifiedText}>
          3.2.5. Своєчасно сплачувати за проживання у гуртожитку.
        </p>
        <p className={styles.justifiedText}>
          3.2.6. Здійснювати вхід до гуртожитку за пред'явленням перепустки встановленого Університетом зразка.
        </p>
        <p className={styles.justifiedText}>
          3.2.7. При запрошені відвідувача до гуртожитку зустріти його біля входу, залишити свою перепустку та документ, що засвідчує особу відвідувача черговому по гуртожитку, особисто забезпечити залишення гостем гуртожитку до 22:00 години. Відвідування дозволено з 10:00 до 22:00 год.
        </p>
        <p className={styles.justifiedText}>
          3.2.8. Постійно підтримувати чистоту і порядок у своїй кімнаті та у місцях загального користування, брати участь у всіх видах робіт, пов'язаних із самообслуговуванням гуртожитку та його благоустроєм, брати участь в проведенні ремонтних робіт, в т.ч. за власний рахунок.
        </p>
        <p className={styles.justifiedText}>
          3.2.9. Забезпечити наявність дублікатів ключів від кімнати в завідувача гуртожитку.
        </p>
        <p className={styles.justifiedText}>
          3.2.10. Надавати доступ до житлових кімнат особам зазначеним в п. 2.1.10.
        </p>
        <p className={styles.justifiedText}>
          3.2.11. Дбайливо ставитись до майна гуртожитку, економно витрачати тепло-електроенергію, газ і воду.
        </p>
        <p className={styles.justifiedText}>
          3.2.12. Своєчасно подавати заявки на ремонт або заміну електричного обладнання, меблів тощо.
        </p>
        <p className={styles.justifiedText}>
          3.2.13. Суворо дотримуватись правил пожежної безпеки при користуванні електричними, газовими та іншими приладами та обладнанням.
        </p>
        <p className={styles.justifiedText}>
          3.2.14. Негайно повідомляти Університет (адміністрацію гуртожитку або чергових по гуртожитку) про будь-які пошкодження, аварії або інші неполадки в результаті яких завдано (або можуть привести) матеріальні збитки житловому приміщенню (гуртожитку), а також своєчасно прийняти заходи для запобігання можливості подальшого руйнування або пошкодження житлового приміщення (гуртожитку).
        </p>
        <p className={styles.justifiedText}>
          3.2.15. Відшкодовувати у встановленому чинним законодавством України порядку заподіяні матеріальні збитки майну гуртожитку, пошкодження житлового приміщення тощо.
        </p>
        <p className={styles.justifiedText}>
          3.2.16. Тимчасово переселятись в інше житлове приміщення відповідно до пункту 2.1.13.
        </p>
      </div>
  );
};

export default Page5Content;